{
    "name": "Alex 的生物",
    "icon": "alexsmobs:tab_icon",
    "category": "mods",
    "pages": [
        {
            "type": "entity",
            "entity": "alexsmobs:grizzly_bear"
        },
        {
            "type": "text",
            "text": "灰熊是生活在森林里的大型杂食哺乳动物，通常情况下，一只成年棕熊会有一两个幼崽跟着。如果没有做好准备，不要轻易靠近，这会让它们感受到威胁并对你发起攻击。$(br2)众所周知，棕熊会袭击蜂巢，把它撕开享用里面的蜂蜜。如果一只棕熊吃饱了蜂蜜，就可以安全地接近了，据说这时喂它吃鲑鱼可以取得它的信任。"
        },
        {
            "type": "text",
            "text": "尽管只有很少人在近距离接触棕熊后活了下来，但他们说棕熊可以当作战斗坐骑。 $(br2)偶尔棕熊会掉落它们的毛，这些毛和力量药水结合可以制成击退抗性药水。 $(br2)下雪的时候，棕熊的皮毛会被雪覆盖。可以用铲子去掉。相反地，也可以在它身上放雪片。当棕熊在水里、淋雨或者在炎热的群系的时候，雪会化掉。"
        },
        {
            "type": "entity",
            "entity": "alexsmobs:roadrunner"
        },
        {
            "type": "text",
            "text": "走鹃是一种生活在沙漠和恶地的中型鸟。相对于它的体型，它又快又灵活。走鹃经常与响尾蛇、其他沙漠动物和它们的猎物发生冲突。"
        },
        {
            "type": "crafting",
            "recipe": "alexsmobs:roadrunner_boots",
            "text": "这种鸟的羽毛很受欢迎，可以用来制作一种能让穿着的人在沙地上跑得更快的靴子。"
        },
        {
            "type": "entity",
            "entity": "alexsmobs:bone_serpent"
        },
        {
            "type": "text",
            "text": "骨蟒是一种巨大的蛇形亡灵生物，栖息在下界的熔岩湖中。有时能看到它们跳出熔岩，随后又潜下去消失。骨蟒不仅是探险家们的威胁，也是凋零骷髅的死敌。当它们锁定目标的时候，它们会从熔岩里跳出来试图碾压猎物。 $(br2)骨蟒被杀死后会炸裂成一堆骨头，也会掉落它们的牙齿。骨蟒牙齿可以和熔岩瓶一起酿造成熔岩明视药水，让你在熔岩中的视野和在水中一样清晰。"
        },
        {
            "type": "entity",
            "entity": "alexsmobs:gazelle"
        },
        {
            "type": "text",
            "text": "瞪羚是一种原生于主世界热带草原的小型哺乳动物。它们体型纤细，胆小谨慎，成群觅食。只要有一只瞪羚被攻击，这一群体的所有成员都会以极快的速度逃离任何感知到的威胁。$(br2)瞪羚被杀死后可能会掉落角，可以和速度II药水酿造成速度III药水，它们也会掉落羊肉。"
        },
        {
            "type": "entity",
            "entity": "alexsmobs:crocodile"
        },
        {
            "type": "text",
            "text": "鳄鱼是一种大型爬行动物，生活在主世界的河流与沼泽中。鳄鱼会突然冲出袭击猎物，把它们拖到水下，展开致命的死亡翻滚。如果突袭的时候撞到什么东西，鳄鱼会晕眩一会。它会攻击靠近的人和其他野兽。$(br2)尽管是敌对生物，鳄鱼还是可以用腐肉繁殖。 喂食后，鳄鱼会到岸上产卵。如果蛋被破坏，鳄鱼父母会变得有攻击性。一段时间后蛋会孵化，小鳄鱼会记住附近的玩家。"
        },
        {
            "type":"text",
            "text":"它会抵御自己的出生地不受怪物侵扰。和它互动可以让它趴下。 $(br2)鳄鱼长大成年或者死亡的时候会掉落鳞片，可以用于制作鳄鱼胸甲，能提高穿着者的游泳速度。也可以用来制作动物图鉴。"
        },
        {
            "type":"crafting",
            "recipe":"alexsmobs:crocodile_chestplate",
            "recipe2":"alexsmobs:animal_dictionary"
        },
        {
            "type":"entity",
            "entity": "alexsmobs:fly"
        },
        {
            "type":"text",
            "text": "苍蝇是一种常见而烦人的小昆虫。会被死了的和快死的东西吸引，会追着僵尸咬。 可以用腐肉繁殖，死亡的时候有概率掉落蛆。蛆可以用来繁殖其他生物，比如走鹃和卷尾猴，有需要的话，也可以吃。 $(br2)如果一只苍蝇进入下界，这只小东西会变成一只可怕的绯红蚊子。"
        },
        {
            "type":"entity",
            "entity": "alexsmobs:hummingbird"
        },
        {
            "type":"text",
            "text":"蜂鸟是已知现存最小的鸟，但它们飞得很快。这些小鸟生活在丛林、繁花森林和向日葵草原。只有一种东西能让这些小家伙们停下来——花。蜂鸟是高效的传粉者，比蜜蜂更高效。可以用花繁殖。"
        },
        {
            "type":"crafting",
            "recipe":"alexsmobs:hummingbird_feeder",
            "text": "制作一个蜂鸟喂食器，灌满糖水来把蜂鸟限制在一小片区域内，还能提高它们的传粉能力。"
        },
        {
            "type":"entity",
            "entity":"alexsmobs:orca"
        },
        {
            "type":"text",
            "text":"虎鲸是一种生活在寒冷海洋中的大型鲸，长得像海豚。可以看到它们穿梭于水面，攻击北极熊。它们也可以用自己的大尾巴一次拍死一群鱼。不像它们的海豚表亲，虎鲸没有那么友好——伤害一只虎鲸，附近的所有虎鲸都会攻击你。 $(br2)和一小群虎鲸一起游泳可以获得虎鲸的恩惠效果，可以提升你的攻击速度。虎鲸也会攻击溺尸和守卫者。"
        },
        {
            "type":"entity",
            "entity":"alexsmobs:sunbird"
        },
        {
            "type":"text",
            "text":"太阳鸟是一种神话般的鹤，翱翔在最高的山上。它是完全被动的，会对任何靠近的玩家赋予它的祝福。被它祝福后，鞘翅飞行会更容易，可以平稳地上下运动，速度也会加快，就像太阳鸟一样。但是，如果太阳鸟被攻击，祝福会变成诅咒，这会让攻击者快速重重地落到地上。 $(br2)作为神圣生物，靠近它的亡灵生物都会被点燃，就像在太阳底下一样。"
        },
        {
            "type":"text",
            "text":"太阳鸟不会被任何种类的火焰或熔岩伤害，因为它们自己就是火焰的化身。"
        },
        {
            "type":"entity",
            "entity":"alexsmobs:gorilla"
        },
        {
            "type":"text",
            "text":"大猩猩是生活在丛林里的群居猿类。大猩猩是和平的丛林保护者，但他们不是毫无防备。 如果被激怒，大猩猩会展现它的恐怖力量。 每组大猩猩都有一个首领，即银背大猩猩，它指挥猩猩部队穿越丛林。$(br2)银背大猩猩比其他大猩猩强壮两到三倍，可以经常看到它不耐烦地捶胸。幼年大猩猩会在父母觅食的时候待在父母背上。 "
        },
        {
            "type":"text",
            "text":"如果给大猩猩香蕉吃，它们会对你更加信任和友好，香蕉可以通过破坏丛林树叶获取。$(br2)如果被给予足够的香蕉，大猩猩可以听从命令坐下或者徘徊在周围，还会自动保护它的新朋友。"
        },
        {
            "type":"entity",
            "entity":"alexsmobs:crimson_mosquito"
        },
        {
            "type":"text",
            "text":"绯红蚊子是一种可怕的突变昆虫，可以在绯红森林里找到。这种贪婪的怪兽会寻找任何温血动物作为猎物，包括人类。它首先会冲向猎物，紧紧抓住，然后吸干。吃饱喝足之后，它就会飞走，并用血对付试图报仇的猎物——把血吐回去。 $(br2)一只吃饱的绯红蚊子被杀死后会掉落血囊，也可能掉落它的口器。这两种材料都可以用来制作血液喷射器，这是一种用血造成范围伤害的武器，使用血囊作为弹药。"
        },
        {
            "type":"crafting",
            "recipe":"alexsmobs:blood_sprayer",
            "text":"如果一只来自主世界的普通苍蝇碰巧进入下界，它会变成一只绯红蚊子。"
        },
        {
            "type":"entity",
            "entity":"alexsmobs:rattlesnake"
        },
        {
            "type":"text",
            "text":"响尾蛇是一种生活在沙漠和恶地的中型爬行动物。大多数时候响尾蛇都是被听到而不是被看到的，因为当潜在的威胁在附近的时候，它会发出响亮的沙沙声作为警告。如果靠的太近，它就会发动进攻，用毒牙保护自己。$(br2)响尾蛇是走鹃的死敌，因为走鹃经常捕食响尾蛇。响尾蛇可以用任何的肉繁殖。$(br2)响尾蛇死后有几率掉落响尾，可以和剧毒药水酿造成毒素精华，这可以和洞穴蜈蚣腿酿造成珍贵的抗毒药水。"
        },
        {
            "type":"entity",
            "entity":"alexsmobs:endergrade"
        },
        {
            "type":"text",
            "text":"末影缓步兽是微小的水熊虫失散多年的表亲。这种生物可能在数百万年前就来到了末地，因为这里缺少原来世界的捕食者，所以长得很大。$(br2)它们可以在紫颂森林里找到，悠闲地飘在空中吃紫颂果。像猪一样，末影缓步兽也可以装上鞍来骑乘。但是，只有手持紫颂果钓竿才能控制。$(br2)紫颂果可以用于繁殖末影缓步兽，也可以用来把它们从高处吸引下来。尽管速度很慢，它们依旧是逃离潜影贝攻击和到达高处的好选择。"
        },
        {
            "type":"entity",
            "entity":"alexsmobs:hammerhead_shark"
        },
        {
            "type":"text",
            "text":"锤头鲨是一种掠食性大型软骨鱼，生活在温暖的水域。锤头鲨会盯上任何低于生命值低于一半的生物，作为食腐动物，它们也喜欢吃热带鱼和鱿鱼。$(br2)在捕食时，锤头鲨会盘旋在猎物周围，寻找理想的攻击角度。偶尔，在攻击猎物时，锤头鲨的许多牙齿可能松脱一颗。这些牙齿可以用来制造箭，可以更好地在水下飞行并对水生生物造成额外伤害。"
        },
        {
            "type":"crafting",
            "recipe":"alexsmobs:shark_tooth_arrow"
        },
        {
            "type":"entity",
            "entity":"alexsmobs:lobster"
        },
        {
            "type":"text",
            "text":"龙虾是小型水生甲壳类动物，可以在海滩附近的水下找到。如果被攻击，龙虾会夹住附近的任何攻击性生物，但不会主动追击。虽然最常见的是红色，但龙虾也有其他更稀有的颜色。被杀死的时候，龙虾偶尔会掉落尾巴，煮熟了很好吃。它们也可以像任何种类的鱼一样放入桶中。"
        },
        {
            "type":"entity",
            "entity":"alexsmobs:komodo_dragon"
        },
        {
            "type":"text",
            "text":"科莫多巨蜥是世界上最大的蜥蜴，生活在遥远的恶地。这些大蜥蜴将人和野兽视为食物，几乎可以攻击任何东西。它们也是会同类相食，会攻击任何其他虚弱的科莫多巨蜥，尤其是小的。这些蜥蜴的咬伤带有毒素，用来放倒猎物。$(br2)科莫多巨蜥热衷于腐肉，一次可以吃掉一组，喂食几组腐肉之后就可以被驯服。被驯服的科莫多巨蜥仍然和野生的一样狂野，但也是一种很快的坐骑。"
        },
        {
            "type":"text",
            "text":"科莫多巨蜥有时候会滴落唾液，和抗毒药水一同酿造可以延长时效。唾液也可以装瓶，和洞穴蜈蚣腿酿造成毒素精华。唾液还可以用来制作粘液球。"
        },
        {
            "type":"entity",
            "entity":"alexsmobs:capuchin_monkey"
        },
        {
            "type":"text",
            "text":"卷尾猴是一种生活在丛林里的灵长动物。它们也很喜欢香蕉，喂食香蕉可以驯服。驯服的卷尾猴比其他驯服的生物（比如狼）更机灵，它们可以待在原地，也可以跟随或者徘徊。它们可以远程攻击，也可以近战。它们还能坐在主人的肩上，此时它们可以对目标扔石头。$(br2)卷尾猴能吃很多东西，喂蛋可以治疗，喂蛆可以繁殖，这是它们最喜欢的食物之一。"
        },
        {
            "type":"crafting",
            "recipe":"alexsmobs:sopa_de_macaco",
            "text":"有时，它们吃完香蕉后会留下香蕉皮。可以用来制作一种叫“猴儿汤”的料理，厨师称其\"Uma Delicia\"（非常美味）。$(br2)在丛林神庙里可以罕见地找到一种叫古代飞镖的宝物，把它给予卷尾猴可以提升它们的攻击范围，附带穿透。"
        },
        {
            "type":"entity",
            "entity":"alexsmobs:centipede_head"
        },
        {
            "type":"text",
            "text":"洞穴蜈蚣是一种深居地下的节肢动物。它会攻击任何侵入它领地的生物。尽管动作迟缓，这种棘手的生物攻击力很高，还有毒。$(br2)被杀死后，洞穴蜈蚣有几率掉落腿。可以用来制作一种护腿，让穿着者可以爬墙，同时提供防护。也可以和毒素精华或者科莫多巨蜥唾液酿造成抗毒药水，让使用者免疫中毒。"
        },
        {
            "type":"crafting",
            "recipe":"alexsmobs:centipede_leggings"
        },
        {
            "type":"entity",
            "entity":"alexsmobs:warped_toad"
        },
        {
            "type":"text",
            "text":"诡异蟾蜍是一种巨大而稀有的两栖动物，生活在下界的诡异森林。这种中立的突变蟾蜍后背被菌光体覆盖，在死后有概率掉落。尽管平常在森林里，它们也是游泳好手，无论是熔岩里还是水里。$(br2)诡异蟾蜍最喜欢的食物是苍蝇和绯红蚊子，它们会极快地发射出舌头粘住猎物。因为诡异森林很少有绯红蚊子，这些蟾蜍会为了绯红蚊子幼虫做任何事，幼虫可以用蛆和绯红蚊子口器合成。"
        },
        {
            "type":"text",
            "text":"多个绯红蚊子幼虫可以用来驯服诡异蟾蜍。你可以让它们坐下，跟随或者在附近徘徊。在后两种状态下，蟾蜍会保护主人，这会是应对绯红蚊子的好手段。诡异蟾蜍可以用蛆治愈，用之前提到的蚊子幼虫繁殖。"
        },
        {
            "type":"entity",
            "entity":"alexsmobs:moose"
        },
        {
            "type":"text",
            "text":"驼鹿是巨大的食草动物，居住在雪原和针叶林。它们并不胆小，一旦遭受攻击，它们会用自己的大角进行强力的反击。你可以经常看到驼鹿用角对顶宣示主权。每7到10天，它们珍贵的大角可能会脱落。$(br2)据说它们的角可以用来制作增加佩戴者击退能力的头饰，新的角需要3到5天长出。驼鹿是称职的父母，会保护孩子不受包括狼在内的威胁。可以用多个蒲公英繁殖，这是它们最喜欢的食物。"
        },
        {
            "type":"crafting",
            "recipe":"alexsmobs:moose_headgear",
            "text":"下雪的时候，驼鹿的皮毛会被雪覆盖，可以用铲子除去。相反地，也可以在它身上放置雪片来造成覆雪效果。雪会在水中或者炎热地区融化。"
        },
        {
            "type":"entity",
            "entity":"alexsmobs:mimicube"
        },
        {
            "type":"text",
            "text":"复刻怪是史莱姆和岩浆怪的近亲，可以在末地城中找到。不像它们的史莱姆亲戚，这些胶状生物使用一种与众不同的强力魔法。被攻击时，复刻怪会复制攻击者的武器装备，这意味着任何戴盔持剑的人会被带有同样装备的复刻怪攻击。在这种情况下，复刻怪可以使用剑、盾、弓、弩、三叉戟、食物和更多。"
        },
        {
            "type":"text",
            "text":"因此对付复刻怪需要特别当心，使用强力的盾或剑可能会被同样的武器打回来。被杀死后，复刻怪可能掉落它们的复刻凝胶。要驾驭这种自然的变形力量，只需在合成网格里面用8个凝胶围绕任何带耐久的物品。仅有少量限制，这可以制造出和原来几乎一模一样的复制品，原有的几乎所有附魔也会被复制。当然，复制品只有0点耐久，需要自己修理。复刻凝胶的神奇能力在以后可能有更多用处。"
        },
        {
            "type":"entity",
            "entity":"alexsmobs:raccoon"
        },
        {
            "type":"text",
            "text":"浣熊是生活在草原和森林的小型哺乳动物。它们是中立生物，会向任何手持食物的人讨食。在晚上，浣熊的眼睛会发光，很容易看到。虽然给这种可爱的动物喂食很有趣，但是大多数情况下没有好处。$(br2)浣熊会从箱子或者木桶里面偷东西吃，并且，和它们可爱的外表不同，它们也可以很有攻击性。浣熊的一种有趣的行为是“清洗”，在水边给予食物，浣熊会在水里把食物洗干净再吃。"
        },
        {
            "type":"text",
            "text":"只有在水边给予鸡蛋才能驯服浣熊，它们会清洗鸡蛋，直到找到自己喜欢的。驯服的浣熊可以被命令坐下，跟随或徘徊。可以用面包繁殖。可以给予浣熊地毯作为头巾，可以用剪刀去除。偶尔浣熊会从村民的物品栏里偷东西。"
        },
        {
            "type":"crafting",
            "recipe":"alexsmobs:frontier_cap",
            "text":"浣熊被杀死的时候有概率掉落尾巴，可以用来制作拓荒者之帽，提供潜行下的速度加成。"
        },
        {
            "type":"entity",
            "entity":"alexsmobs:blobfish"
        },
        {
            "type":"text",
            "text":"水滴鱼身体呈凝胶状，生活在最深的海底。自然状态下是灰色，但水压小于10个方块的时候会变成粉色。杀死后，4条水滴鱼和一个玻璃瓶可合成鱼油。可以让饮用者漂浮在水上或雨中。$(br2)它们也可以像其他鱼那样装在桶里。对水滴鱼使用粘液球可以让它在陆地上存活，通常用来展示，毕竟这确实是种有趣的生物。"
        },
        {
            "type":"crafting",
            "recipe":"alexsmobs:fish_oil"
        },
        {
            "type":"entity",
            "entity":"alexsmobs:seal"
        },
        {
            "type":"text",
            "text":"海豹是最常见的海洋哺乳动物，可以在沙滩和冰山上找到。它们很懒散，通常趴在沙子和冰上。但在水中，它们却是游泳高手，可以轻松地围住大多数海洋生物，除了它们的终极捕食者：虎鲸。如果一只海豹被攻击，周围的所有海豹都会试图逃到水里，在那里它们更灵活。"
        },
        {
            "type":"text",
            "text":"给趴在岸边的海豹3条鱼可以启动一种类似于交易的行为：海豹会潜到海底，挖掘一些东西带回来。$(br2)尽管大多数时候都是海带和沙子之类的垃圾，有时候也会是鲨鱼牙齿，鳞甲或者鹦鹉螺壳这样有价值的物品。海豹可用龙虾尾繁殖。"
        },
        {
            "type":"entity",
            "entity":"alexsmobs:cockroach"
        },
        {
            "type":"text",
            "text":"蟑螂是一种肮脏的虫子，生活在暗无天日的地下。它们害怕光线，似乎光让它们更容易被捕食。在一群蟑螂中间放置火把，它们会四散逃离。蟑螂繁殖力很强，会产下卵鞘，里面有许多蟑螂幼虫。$(br2)虽然蟑螂在人周围很容易受到惊吓，但可以喂食面包或糖来安抚它们。蟑螂被认为是一种害虫，因为它们会吃掉任何掉落的食物，因此将食物无人看管地留在洞穴中很危险。 用复刻凝胶涂抹蟑螂可以给它们加上炫彩的外观。"
        },
        {
            "type":"text",
            "text":"据说它们很喜欢沙槌。 $(br2)蟑螂是洞穴蜈蚣的天然猎物，蜈蚣在远处就可以发现它们。严重受伤的时候，它们有可能失去头部，但它们还是可以正常存活。$(br2)死亡的时候有概率掉落残翼，用9个来合成完整的蟑螂翼，可以用来酿造引虫药水。可以让你不被敌对的节肢动物发现，但不是完全隐身。蟑螂可用糖繁殖。"
        },
        {
            "type":"entity",
            "entity":"alexsmobs:shoebill"
        },
        {
            "type":"text",
            "text":"鲸头鹳是生活在沼泽中的一种奇怪鹳鸟。这些看起来令人生畏的鸟实际上非常胆小，在受到攻击时会飞走。 长着大而奇怪的喙。 独处时，经常可以看到鲸头鹳在钓鱼，捕捉他们最喜欢的食物。 很多时候，这会产生对它们无用的副渔获物，但并非对每个人都如此。$(br2)喂食鳄鱼蛋可以提高鲸头鹳钓鱼的“饵钓”能力，而水滴鱼可以提高“幸运”能力。鲸头鹳非常胆小，无法被繁殖。 除了鱼，它们也会攻击小鳄鱼和乌龟，这两个也是它们的食物。"
        },
        {
            "type":"entity",
            "entity":"alexsmobs:elephant"
        },
        {
            "type":"text",
            "text":"大象是巨大的陆地哺乳动物，成群结队地在稀树草原上漫游。在大多数象群中，有三种大象：小象、有长牙的和没长牙的。一个群里通常会有一两只长牙的大象，它们比其他大象要强壮得多。它们可以进行一种特别的、毁灭性的冲锋攻击。$(br2)大象会保护自己的族群，并且大多数依靠这些长着象牙的个体来提供最大的保护。除了冲锋之外，大象还可以通过多种方式进行攻击，包括使用它们巨大的象鼻来抛掷敌人，或者抬起脚踩踏。"
        },
        {
            "type":"text",
            "text":"大象经常站起来从树上撕下叶子，这是为了获得一种称为金合欢花的稀有食物。 这些花可以通过破坏金合欢树叶罕见地掉落，可以喂给大象来驯服它们。野生长牙大象无法驯服，但小象和没有长牙的大象可以。驯服的长牙大象只能在它还小的时候将其驯服来获得。$(br2)驯服的大象可以骑乘。如果在大象身上使用箱子，它可以获得相当大的储存空间，可以通过潜行访问。"
        },
        {
            "type":"text",
            "text":"可以用任何地毯来装饰大象。箱子和地毯都可以使用剪刀移除。驯服的长着象牙的大象可以通过在骑乘时喂食小麦来进行冲刺。这种冲刺攻击使大象加速并对路径上的生物造成大量伤害。大象在冲刺后需要休息一段时间。$(br2)一旦被驯服，大象就可以用金合欢花繁殖。有时，炎热生物群系中的流浪商人会坐着大象。这些大象是有箱子的，并且有一些被玩家查看其中的物品。"
        },
        {
            "type":"entity",
            "entity":"alexsmobs:soul_vulture"
        },
        {
            "type":"text",
            "text":"灵魂鹫是灵魂沙峡谷中早已死亡的鸟类的凋零遗骸，这些亡灵鸟盘旋在无数散落四处的骨骸上空。接近灵魂鹫的时候，它会窃取探险家的生命，这能让它们的血量达到猎物血量上限的5倍。被杀死后可能会掉落灵魂之心。灵魂之心可以用来酿造灵魂汲取药水，可以让饮用者拥有和这种鸟一样的能力。$(br2)像凋零骷髅那样，灵魂鹫也是猪灵的敌人，还是骨蟒的猎物。"
        },
        {
            "type":"entity",
            "entity":"alexsmobs:snow_leopard"
        },
        {
            "type":"text",
            "text":"雪豹是大型猫科动物，可以在多雪的山区找到。这些大猫虽然是贪婪的猎人，但并不主动攻击人类。它们经常坐在或睡在白雪皑皑的山峰上。它们会跟踪牲畜，尤其是他们最喜欢的猎物绵羊。$(br2)雪豹会弓起背部并潜行到猎物身后，然后发动致命的跳跃攻击。这些大猫也可以在近战中使用它们的爪子进行攻击。雪豹是非常熟练的捕食者，它们的杀戮通常会产生额外的掉落物，似乎这种生物自带抢夺。 "
        },
        {
            "type":"text",
            "text":"尽管雪豹无法被驯服，但它们可以用驼鹿肋骨繁殖，驼鹿肋骨是一种它们梦寐以求的生物的肉。这些大型猫科动物不会被推倒，它们会保护自己或它们的后代免受任何攻击。"
        },
        {
            "type":"entity",
            "entity":"alexsmobs:spectre"
        },
        {
            "type":"text",
            "text":"灵翼是幻翼的远亲，只能在末地岛屿之间的广袤虚空中找到。这些幻灵生物无法被通常的方式伤害，除了药水的魔法伤害。但是，完全没有必要去攻击它们，因为灵翼是完全被动的，不像幻翼。它们对平常的东西不感兴趣，但灵魂之心对它们有特别的吸引力，灵翼会跟随手持灵魂之心的玩家。如果能让它靠的足够近，可以用拴绳把自己捆在它身上。这样做的话，它可以带着玩家在空中飞行。这样它就成了一种穿越末地的极好方式。 $(br2)要解开绳子，只需潜行或者用拴绳再次右键。"
        },
        {
            "type":"entity",
            "entity":"alexsmobs:crow"
        },
        {
            "type":"text",
            "text":"乌鸦是生活在森林和平原的聒噪的鸟。它们被认为是害鸟，因为它们经常出现在田地周围并破坏作物生长。只需一个雕刻过的南瓜就足以吓跑一小块田地里的所有乌鸦。每当有人靠近时，这些鸟会分散并飞走。乌鸦会叼起它们可以放进嘴里的任何食物并吃掉。 $(br2) 尽管看起来阴暗，实际上可以通过向它们扔一些南瓜子来驯服它们。驯服的乌鸦是非常有用的生物，可以坐下、徘徊、跟随或收集物品。"
        },
        {
            "type":"text",
            "text":"坐在干草块上的驯服的乌鸦会慢慢恢复生命值。之后，当它们准备收集物品时，它们也会绕着这个干草块飞来飞去。当乌鸦在设置为收集物品时捡起一个物品，它会寻找一个上面有一个与所持有的物品相匹配的物品展示框的容器，如箱子或熔炉。如果框架中的物品与乌鸦嘴中的物品相同，它将把物品从那一侧放入容器中。 当设置为跟随时，乌鸦会在它们的主人周围飞来飞去，并在一段时间后尝试坐在主人的肩膀上。"
        },
        {
            "type":"text",
            "text":"乌鸦可以通过潜行从肩膀上移除。当乌鸦保护它们的主人时，它们会啄食攻击者，造成比较低的伤害，不足以让怪物反击。然而，乌鸦会对亡灵生物造成额外伤害。"
        },
        {
            "type":"entity",
            "entity":"alexsmobs:alligator_snapping_turtle"
        },
        {
            "type":"text",
            "text":"鳄龟是一种体型巨大的半水生爬行动物，生活在沼泽中。与它们被动的海龟表亲不同，鳄龟是一种凶猛的野兽，会攻击任何靠近它锋利的喙状嘴的东西。它们的咬合速度和移动速度都很快，如果遇到它们最好不要接近。$(br2)它们很少移动，有时在水下待几天之后，背上会长出苔藓。如果长满了可以被剪掉，有机会掉落锥形鳞甲，可用于升级海龟壳。 大鳄龟壳头盔附带击退抗性，允许玩家在水下呼吸额外 15 秒。它偶尔也可以反击近战攻击。鳄龟可以用生鳕鱼繁殖。"
        },
        {
            "type":"entity",
            "entity":"alexsmobs:mungus"
        },
        {
            "type":"text",
            "text":"蘑菇君是生活在蘑菇岛的奇特真菌生物，这种古怪的生物是守卫者和炽足兽的亲戚，看起来也很像。不像它们的守卫者祖先，蘑菇君是被动生物。 有时候会有蘑菇穿透它们的菌丝外衣长出来。如果给它们喂食更多同种蘑菇，它们身上的蘑菇数量会增加。身上有蘑菇的时候，它会对附近的同种蘑菇发射类似守卫者的光线。这会长出更多蘑菇，如果是在菌丝上，蘑菇还有可能会长大。"
        },
        {
            "type":"text",
            "text":"这会耗尽它的体力，也会消耗它身上的蘑菇数量。如果杀死一只长了5个蘑菇的蘑菇君，它会爆炸，冰并把周围的区域转换成与蘑菇种类相符的群系：红色/棕色蘑菇——蘑菇岛，绯红菌——绯红森林，诡异菌——诡异森林。这一过程可以通过喂食毒马铃薯来取消。蘑菇君可用蘑菇煲繁殖。"
        },
        {
            "type":"entity",
            "entity":"alexsmobs:mantis_shrimp"
        },
        {
            "type":"text",
            "text":"皮皮虾是生活在温暖海洋的珊瑚礁中巨型甲壳类动物。这些巨型虾有两个强大的拳头，挥拳速度足以点燃猎物。 这些拳头还可以快速移动以将敌人击退并突破障碍物。虽然是中立的，但激怒它们是不明智的。螳螂虾捕食热带鱼、鱿鱼、守卫者，甚至是潜影贝。$(br2) 螳螂虾可以通过喂食 10 到 30 条热带鱼来驯服。 如果螳螂虾离开水超过 5 分钟，它就会失水。"
        },
        {
            "type":"text",
            "text":"这可以通过在潜行时给驯服的螳螂虾水桶来防止，这样它们就可以永远地离开水了。 驯服的螳螂虾可以跟随、坐下、徘徊和破坏方块。 当拿着一个方块与潜行互动时，你可以把这个方块交给螳螂虾。然后，如果命令它破坏方块，皮皮虾将寻找并破坏任何与拳头中的方块匹配的方块。 螳螂虾受伤时可以用任何种类的鱼治愈，也可以用龙虾尾繁殖。"
        },
        {
            "type":"entity",
            "entity":"alexsmobs:guster"
        },
        {
            "type":"text",
            "text":"沙风怪是一种只在沙尘暴期间出现的沙漠怨灵。沙风怪是敌对的，会把被它盯上的生物抛到空中，或者对猎物喷沙。它也会把掉落物吹走。$(br2)沙风怪由沙子构成，如果它所在的地方是灵魂沙或红沙，它的外貌也会相应地变化。虽然强力，但沙风怪的防御力并不高。然而，它们几乎全是空气的身体使它们比大多数怪物更能抵抗弹射物攻击。"
        },
        {
            "type":"text",
            "text":"击杀后，沙风怪会掉落沙子，也有机会掉落一只眼睛。这种眼睛可以用来制作造风器，当被红石激活，就会发出一股小型旋风，可以推走生物和物品。眼睛也可以用来制作含沙射之袋，是一种武器。"
        },
        {
            "type":"crafting",
            "recipe":"alexsmobs:pocket_sand",
            "recipe2":"alexsmobs:gustmaker"
        },
        {
            "type":"entity",
            "entity":"alexsmobs:warped_mosco"
        },
        {
            "type":"text",
            "text":"诡异蚊鬼是一种极其危险而强大的绯红蚊子突变体。当一只绯红蚊子吸食一只覆盖着诡异菌的真菌生物的血的时候，它就会开始变异。转变完成后，诡异蚊鬼会发怒，使用它巨大的身体攻击周围任何被它当作食物的生物。它的攻击方式包括空中下砸，冲击，碾压和吸血。"
        },
        {
            "type":"crafting",
            "recipe":"alexsmobs:hemolymph_blaster",
            "text":"如果被杀死（尽管有些难），诡异蚊鬼会掉落诡异肌和血淋巴囊，这些和其他材料可以用来制作血淋巴喷射器，血液喷射器的升级版本。"
        },
        {
            "type":"entity",
            "entity":"alexsmobs:straddler"
        },
        {
            "type":"text",
            "text":"跨座兽身形巨大，是炽足兽的近亲。和炽足兽不同的是，跨座兽只能在玄武岩三角洲找到，而且它们的适应性更强，在陆地和水中都能正常存活。可惜，它们是敌对生物。任何过于接近的人都会被视作入侵者，跨座兽会立刻发动攻击，它们使用自己长长的网状毛发向目标发射跨座蝌蚪，造成可观的伤害。被杀死后，跨座兽会掉落玄武岩，偶尔也会掉落跨座晶石。这种不寻常的矿物可以用来制作跨板。"
        },
        {
            "type":"text",
            "text":"跨板可以染色，可以浮在熔岩上，但会在水里下沉。跨板可以用来轻易穿越下界宽阔的熔岩海。但是，不像炽足兽那么安全，跨板很容易翻倒，因此使用它的航行快捷但危险。"
        },
        {
            "type":"crafting",
            "recipe":"alexsmobs:straddleboard",
            "text":"如果使用跨板航行的人撞到什么东西，估计就要死在熔岩里面了。"
        },
        {
            "type":"entity",
            "entity":"alexsmobs:stradpole"
        },
        {
            "type":"text",
            "text":"跨座蝌蚪是跨座兽的幼体形态，生活在玄武岩三角洲的浅熔岩池里面，也会被跨座兽作为弹药发射出来。使用熔岩桶可以方便地转移跨座蝌蚪，这样跨座蝌蚪也不会消失。$(br2)给跨座蝌蚪喂食它们最喜欢的绯红蚊子幼虫有概率让它们长成成年状态，不过它们会反过来攻击玩家。跨座蝌蚪在水里和在熔岩里一样自在，因此是水族馆里富有异域风格的珍藏。 "
        },
        {
            "type":"entity",
            "entity":"alexsmobs:emu"
        },
        {
            "type":"text",
            "text":"鸸鹋是一种不能飞行的大型鸟类，生活在恶地和热带草原。鸸鹋虽然外表略显滑稽，但也不可小觑。传说中这些生物曾经胜过了与一个先进国家的战争，仅仅是因为它们具有不可思议的躲避弹丸的能力，数量众多且速度快。$(br2)被攻击后，鸸鹋首先是惊慌地逃跑，但有些会回来反击。它们用自己的大爪子撕裂猎物。鸸鹋不喜欢弓箭，所以会攻击骷髅。它们可以用小麦繁殖，可能会杂交出几种新的花色。"
        },
        {
            "type":"text",
            "text":"鸸鹋有时会下蓝色的大蛋，可以煮熟食用。死亡时会掉落鸸鹋羽毛，可以用来制作一种特殊的护腿，能让穿着的人像鸸鹋那样躲避一些弹射物的伤害，羽毛也能用来制作旗帜图案。"
        },
        {
            "type":"entity",
            "entity":"alexsmobs:platypus"
        },
        {
            "type":"text",
            "text":"鸭嘴兽看起来像是其他几种动物的结合，但它完全是独立的物种。它可以在河流里罕见地找到。这种奇怪的哺乳动物在脚上长有毒刺，用毒素反击攻击者。$(br2)鸭嘴兽的嗅觉、听觉和视觉都不灵敏，因此它们使用电信号捕猎和导航。所以它们会被手持红石的人吸引。给它喂食一些红石，可以提高它感知电流的能力，它还会从附近的粘土里挖出蛆。"
        },
        {
            "type":"text",
            "text":"寻找食物的时候，鸭嘴兽会挖出一些粘土球和蛆，你可以收集这些物品。如果喂食一整个红石块，挖出来的物品数量会更多。像其他水生动物一样，鸭嘴兽也能用桶装。可以用它们最爱的龙虾尾繁殖。"
        },
        {
            "type":"entity",
            "entity":"alexsmobs:dropbear"
        },
        {
            "type":"text",
            "text":"悬熊是一种敌对的、长相恐怖的有袋动物，生活在下界荒地。这种生物通常倒挂在下界的天花板上，等待无辜的猎物从下面经过。当有猎物经过的时候，它会从天花板上跳下来扑到猎物身上。着陆之后，它会用大嘴和爪子进行攻击。如果成功送走猎物，它就会跳回天花板上。$(br2)悬熊被杀死后会掉落它的爪子，如果有需要的话可以用来制作打火石。也可以用来酿造一种药水，可以让饮用者在天花板上站立和行走。"
        },
        {
            "type":"entity",
            "entity":"alexsmobs:tasmanian_devil"
        },
        {
            "type":"text",
            "text":"袋獾是一种矮小的有袋动物，稀有地存在于温带森林。这些生物最有辨识性的是它们的黑白皮毛和奇怪的咆哮声。经常可以看到他们成群结队地坐着或晒太阳。当捕猎他们最喜欢的兔子或鸡时，附近的所有袋獾都会加入狩猎。$(br2)尽管袋獾体型小，但会保护自己免受任何攻击者的攻击。如果喂食它们最喜欢的腐肉，袋獾会发出一声嚎叫，可以在短时间内吓跑附近的所有怪物。这些脾气暴躁的小动物无法驯服，但可以用任何肉来繁殖。"
        },
        {
            "type":"entity",
            "entity":"alexsmobs:kangaroo"
        },
        {
            "type":"text",
            "text":"袋鼠是大型的中立有袋动物，原产于热带草原和恶地。这些生物的运动方式很独特：它们只能通过跳跃来移动。有时可以看到他们的育儿袋里有一只幼崽。它们的外观颇有点史前风格。袋鼠是严格的食草动物。然而，它们不是好欺负的。如果受到攻击，袋鼠会拳打脚踢，造成致命伤害。被杀死时，它们会掉落一些肉，这些肉可以煮熟并制成美味的袋鼠汉堡。还会掉落袋鼠皮，这些皮可以制作成皮革或独特的旗帜图案。"
        },
        {
            "type":"text",
            "text":"袋鼠可以用十到十五根胡萝卜来驯服。被驯服后，你可以通过与它们互动来命令它们坐下、跟随或徘徊，并通过潜行来访问袋鼠的育儿袋。如果袋子里放有近战武器，袋鼠会在攻击时使用它。成年袋鼠还可以装备任何放在育儿袋里的头盔或胸甲，并且可以在受伤时吃掉放在袋子里的任何非肉类食物来恢复生命值。袋鼠可以用枯死的灌木或草繁殖。"
        },
        {
            "type":"entity",
            "entity":"alexsmobs:cachalot_whale"
        },
        {
            "type":"text",
            "text":"抹香鲸是一种体型巨大的中立哺乳动物，生活在温水和冷水深海中，在那里可以看到它捕猎最喜欢的猎物——鱿鱼。它们通过发出声音来回声定位猎物，当声波击中鱿鱼时，它会反弹回鲸鱼，这样抹香鲸就知道了鱿鱼的位置。$(br2)之后，鲸鱼继续加速并张开满是锋利牙齿的嘴冲向猎物。有时，鲸鱼可能会在此过程中掉下其中一颗长牙。这些鲸鱼在移动时能够破冰，但如果是冲刺状态，它们可以打破船只和其他种类的木头。全白的抹香鲸非常罕见，它们比其他抹香鲸强壮得多。"
        },
        {
            "type":"text",
            "text":"尽管抹香鲸体型巨大，但它仍然受到一些自然力量的威胁。虎鲸喜欢吃抹香鲸幼崽，它们的母亲会极力保护它们免受伤害。在雷暴期间，抹香鲸可能被冲上海滩。它们这时候没法自救，如果有人把它们毫发无损地推回水里，抹香鲸会吐出一些龙涎香作为回报，龙涎香是一种值钱的东西。龙涎香可以卖给渔民村民换取大量绿宝石，或者用来制作回声定位器。"
        },
        {
            "type":"text",
            "text":"龙涎香也是一种强力的燃料，可以烧炼64个物品。$(br2)回声定位器可以探明附近的洞穴，如果发现了洞穴，定位器会发出指向洞穴的声波。不过要谨慎使用，因为次数有限。回声定位器和4个末影珍珠可以制作成末影定位器，可以用来寻找要塞里的末地传送门。"
        },
        {
            "type":"crafting",
            "recipe":"alexsmobs:echolocator",
            "recipe2":"alexsmobs:endolocator"
        },
        {
            "type":"entity",
            "entity":"alexsmobs:leafcutter_ant"
        },
        {
            "type":"text",
            "text":"切叶蚁是一种体型很小的昆虫，在丛林中经常可以看到它们从树上撕下树叶。它们形成多达20只蚂蚁的大群。有两种形式的切叶蚁：工蚁，它们采摘树叶，可以在蚁丘外看到；蚁后，它们只会在踩到蚁丘的时候出现。蚁后比工蚁更强壮，一群中通常只有一个。当蚁丘中有蚁后，且种群个体数量小于10的时候，每收获5块树叶就有机会产生一只新的工蚁。"
        },
        {
            "type":"text",
            "text":"如果没有蚁后，这个种群就难以为继。它们的住所相对于它们的体型不是一般地大，在蚁丘的下方是一个个切叶蚁室组成的网络，还有用树叶培育真菌的方块。如果暴露在阳光下，切叶蚁室会变成泥土，但是它们也可以扩散到临近的泥土中。它们培育出的食物叫菌丝球，这也是它们唯一的食物来源。除了蚂蚁，人也可以食用，尽管没有多少营养价值，它却能提供大量的饱和度。"
        },
        {
            "type":"text",
            "text":"菌丝球可以通过右键互动切叶蚁室采集，不过要注意，如果周围没有菌光体，这种行为会激怒它们。菌丝球可以喂给蚂蚁恢复生命值，或者给蚁后来扩大种群规模。菌丝球也可以用来安抚一个区域的切叶蚁。如果切叶蚁室被破坏，小概率掉落一个切叶蚁蛹，右键草方块或泥土来创建一个新的种群。"
        },
        {
            "type":"entity",
            "entity":"alexsmobs:enderiophage"
        },
        {
            "type":"text",
            "text":"末影噬菌体是一种怪物般的生物机械，可以在末地中型岛屿找到。这种非自然的生物被创造出来只有一个目的——消灭末影缓步兽。然而，由于它们数量稀少，所以它们的创造者似乎没有成功。末影噬菌体通过造成一种叫末地流感的效果捕猎，尽管效果只持续10分钟，但时间结束后，宿主的身体里会冒出新的噬菌体，宿主也会立刻死亡。这种效果可以通过紫颂果或牛奶解除。其他感染的生物也可以用紫颂果治愈。"
        },
        {
            "type":"text",
            "text":"末影噬菌体在大多数时候是中立的，但会攻击末影人。每进行一次攻击，末影噬菌体体内的末影之眼就会碎裂，所以它们要寻找末影人来补充。为了恢复感染能力，末影噬菌体会夺取末影人的眼球使之致盲，没有末影之眼的末影噬菌体不能感染生物。 $(br2)被杀死后，末影噬菌体会掉落衣壳。"
        },
        {
            "type":"text",
            "text":"衣壳可以装一组物品，如果它上面有另一个衣壳或者其他容器，物品会上浮到里面。因此，衣壳可以用来向上传输物品。衣壳可以和铁粒、末地石一起制作末影噬菌体火箭，可以在鞘翅飞行的时候代替普通的烟花火箭。如果在一个放置在竖直末地烛上面的衣壳里放一个末影之眼，可以创造一个末影噬菌体！如果不是按照这种方式组装，所有自然存在的末影噬菌体似乎都是用它们目前所在的维度的常见材料组成的，也许这就是它们的来源..."
        },
        {
            "type":"entity",
            "entity":"alexsmobs:bald_eagle"
        },
        {
            "type":"text",
            "text":"白头鹰是在树木繁茂的山地中生活的大型中立猛禽。他们是附近湖泊的常客，在那里他们会尝试潜水，从水中捞出鲑鱼。它们也喜欢以同样的方式攻击兔子。当攻击更大的生物时，白头鹰更喜欢盘旋，用爪子抓，然后重复这个过程。$(br2)因为它们很喜欢鱼，白头鹰可以用鱼油引诱和驯服。和许多其他动物一样，驯服的白头鹰可以被命令坐下、跟随和徘徊，但它们也可以用作猎鹰。要开始猎鹰活动，需要制作猎鹰手套。"
        },
        {
            "type":"text",
            "text":"无论装备在主手还是副手，这手套都可以把猎鹰接到手上。要放飞猎鹰，只需按左键。如果对着其他生物放飞，它会飞向那只生物并攻击，如果活下来的话还会回到手上。如果没有指定目标，它只会从手上跳下来。要提高它们的技巧，可以制作一个猎鹰兜帽。兜帽可以戴在鹰的头上，放飞之后，主人可以直接控制鹰的动作。如果鹰飞到了离主人150个方块远的地方，它会尝试返回。要停止控制，只需要潜行。兜帽可以用剪刀取下。"
        },
        {
            "type":"text",
            "text":"鹰经常在捕猎的时候受伤，驯服的鹰可以用鱼治疗。白头鹰可以用腐肉繁殖。"
        },
        {
            "type":"crafting",
            "recipe":"alexsmobs:falconry_glove",
            "recipe2":"alexsmobs:falconry_hood"
        },
        {
            "type":"entity",
            "entity":"alexsmobs:tiger"
        },
        {
            "type":"text",
            "text":"老虎是大型猫科动物，生活在竹林里。它们天生讨厌外来者，一旦接近就会发动攻击。老虎是个优秀的猎手，而且非常强壮，能从许多方块外一跃而下粉碎猎物，还能用爪子撕抓。老虎也是偷袭大师，因为当它们从远处跟踪猎物时，它们能够变得几乎隐形。它们的速度也非常快。最厉害的是，老虎出现的时候，它们的猎物甚至会因为恐惧而无法动弹。"
        },
        {
            "type":"text",
            "text":"尽管有着可怕的力量和外表，这些生物并非怪物。通过喂它们最喜欢的鸡肉、猪排或其他新鲜肉类，可以获得老虎的祝福，这种效果可以让人接近老虎而不会受到伤害。这种效果也能让老虎在你陷入危险的时候来帮忙，但是这效果只能持续几分钟，所以你要一直喂肉才能让它们保持中立。如果你攻击了一只老虎，效果也会消失。"
        },
        {
            "type":"text",
            "text":"老虎是防备心强的父母。尽管它们主要是食肉动物，但它们可以用金合欢繁殖。繁殖出的小老虎偶尔是白色的。"
        },
        {
            "type":"entity",
            "entity":"alexsmobs:tarantula_hawk"
        },
        {
            "type":"text",
            "text":"尽管名字里有“蛛”和“鹰”，沙漠蛛蜂既不是蜘蛛也不是鸟。它们是巨大的寄生蜂，在沙漠的空中嗡嗡飞行。尽管外表可怕，但它们对其他生物没有兴趣，是中立的。沙漠蛛蜂的名字来源于它们最喜欢的猎物：蜘蛛。它们会飞到蜘蛛身上蛰一下，然后就在旁边飞，直到蜘蛛完全不能动弹，它们才会把蜘蛛拖到一旁，埋在地下。"
        },
        {
            "type":"text",
            "text":"攻击的时候，沙漠蛛蜂对猎物的蛰刺附带衰弱效果，这会使节肢动物完全失去行动能力，使非节肢动物的生命值减小到最大生命值的一半。和沙漠蛛蜂的战斗并不容易，它们的飞行轨迹很不规则，而且会频繁攻击。沙漠蛛蜂可以用15~25个蜘蛛眼驯服。它们会是有效的应对许多怪物的手段，它们的蛰刺对蜘蛛一类的节肢动物极其有效。两只驯服的沙漠蛛蜂可以发酵蛛眼繁殖。"
        },
        {
            "type":"text",
            "text":"繁殖过程中，沙漠蛛蜂会寻找蜘蛛来麻痹，一段时间后一只小沙漠蛛蜂会在从埋蜘蛛的地方出现。驯服的沙漠蛛蜂可以用花治愈。在下界繁殖的沙漠蛛蜂将带有黄橙相间的图案。$(br2)沙漠蛛蜂被杀死后会掉落残翼，9个残翼可以合成一片完整的。两片翅膀可以和鞘翅合成沙漠蛛蜂鞘翅，提供3点护甲值和更多耐久，还可以附魔。破损的翅膀也可以用来制作旗帜图案。"
        },
        {
            "type":"entity",
            "entity":"alexsmobs:void_worm"
        },
        {
            "type":"text",
            "text":"虚空蠕虫是生活在末地下面的虚空中的古老生物。人们认为它是一种跨维度的寄生虫，拥有穿越空间的能力。召唤这个Boss的方法便是向虚空中投入一个神秘蠕虫，神秘蠕虫的获得方式是将绯红蚊子的幼虫放入末地噬菌体的衣壳中。$(br2)虚空蠕虫有多种攻击方式，第一，虚空蠕虫可以从口中吐出4个虚空水晶，虚空水晶无法击碎，且会自动追踪附近的猎物，对猎物造成致命打击。"
        },
        {
            "type":"text",
            "text":"第二。虚空蠕虫可以直接进行撕咬。第三，虚空蠕虫可以撕开一个传送门，直接找到隐藏的猎物。要打败它，就必须对头部造成大量伤害。如果身体的一节严重受伤，会停止发光，如果这一节被破坏，虚空蠕虫会分裂成两段。分裂的蠕虫个体只有一半的血量，移动速度也要慢一点，但攻击力还是很高。所以不够小心的话，可能要应对一大群虫子。"
        },
        {
            "type":"text",
            "text":"虚空蠕虫被击败后会掉落一个虚空蠕虫之眼和两个神秘蠕虫上颚，上颚可以合成虚空蠕虫嘴，当被红石激活时，便会咬住站在其中的生物。眼球和下界合金可以制作一把神奇的镐：维度撕裂者。和其他镐不同，维度撕裂者不能破坏方块，而是破坏现实本身。不论在何处使用，都可以制造出一个通向出生点的传送门。而在另一边也会出现一个暂时的返回传送门，持续1分钟。不要滥用此工具，因为只有20次使用机会。"
        },
        {
            "type":"entity",
            "entity":"alexsmobs:frilled_shark"
        },
        {
            "type":"text",
            "text":"皱鳃鲨是一种慵懒的古老生物，生活在深海。这种中立的鲨鱼大部分时间都在捕食水滴鱼和鱿鱼。捕猎鱿鱼的时候，它们会利用深海的低光照和鱿鱼的本能，使用反光的牙齿引诱鱿鱼。在咬住猎物后，皱鳃鲨会使用锯齿状的牙齿来造成伤害，并造成流血效果，以此快速杀死猎物。在捕食的过程中，皱鳃鲨有几率会掉落鲨鱼锯齿。"
        },
        {
            "type":"text",
            "text":"你可以利用鲨鱼锯齿和其它一些材料来制作深澜之盾，深之盾比普通盾牌更加坚固，同时，在防御时会对敌人施加失血效果。你可以使用水桶将皱鳃鲨装起来，但如果皱鳃鲨处于小于10个方块的水压下，便会变色，而且速度会降低。"
        },
        {
            "type":"entity",
            "entity":"alexsmobs:mimic_octopus"
        },
        {
            "type":"text",
            "text":"拟态章鱼是生活在在暖水海洋中的被动型头足类动物。它本身是其他许多动物的猎物，因此它进化出了快速再生和模仿周围环境的能力。拟态章鱼可以改变颜色，这取决于它所待在的地方。它们也可以模仿河豚，苦力怕和守卫者。拟态时，其它生物是发现不了它的。"
        },
        {
            "type":"text",
            "text":"玩家可以使用5-8个龙虾尾来驯服这些生物，前提是它们没有进行拟态。虽然是被动拟态，但当有生物对它们的主人构成威胁时，它会变成怪物的形态来吓跑这些生物。被驯服后，它们会跟随者它们的主人来到陆地，但要注意它们在陆地环境会脱水，所以要每隔几天使用粘液球对它们进行保湿。你也可以使用墨囊来使拟态章鱼变换颜色。"
        },
        {
            "type":"text",
            "text":"你可以使用海晶碎片使拟态章鱼变成守卫者形态，使用火药变成苦力怕形态，使用河豚变成河豚形态。（对应物品不会消耗）和其他可驯服的生物一样，你可以命令拟态章鱼坐下，行走或跟随。如果给拟态章鱼喂食5-8个复刻凝胶，那它不仅可以变换形状，还可以使用对应生物的能力。"
        },
        {
            "type":"text",
            "text":"例如，它可以发射守卫者的光波，苦力怕的爆炸和河豚的毒刺。$(br2)驯服后的拟态章鱼可以装进桶里，用热带鱼繁殖。你需要注意拟态章鱼的天敌，例如鲨鱼和皮皮虾，尽量让你的拟态章鱼远离它们。"
        },
        {
            "type":"entity",
            "entity":"alexsmobs:seagull"
        },
        {
            "type":"text",
            "text":"海鸥是一种常见于海滩上的中型鸟类。这些鸟因其能够窃取食物而出名，无论食物是手持还是在快捷栏中。它们还会捡起并吃掉地上的任何食物。海鸥每隔一到三分钟就会偷东西，所以虽然很烦人，但它们算不上威胁。$(br2)然而，海鸥不仅仅是一种烦人的鸟。如果一个人的副手有一张通向埋藏宝藏的地图，人们可以将龙虾尾扔到地上。吃掉它的海鸥会直接坐在埋藏的宝藏上方来奖励它的喂食者。一旦宝藏离地图上的“X”距离足够近，这将极大地帮助定位宝藏。海鸥可以用生鳕鱼繁殖。"
        },
        {
            "type":"text",
            "text":"N Wither, 累坏了 QAQ",
            "title":"翻译"
        }
    ]
}